iPythonx98/InternetOfThings2/Labo3/IoT2_labo_SPI_opg1/IoT2_labo_SPI_opg1_start/IoT2_labo_SPI_opg1/IoT2_labo_SPI.cydsn/Generated_Source/PSoC5/SWITCHES.h
/*******************************************************************************
* File Name: SWITCHES.h  
* Version 1.90
*
* Description:
*  This file containts Status Register function prototypes and register defines
*
* Note:
*
********************************************************************************
* Copyright 2008-2015, Cypress Semiconductor Corporation.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions, 
* disclaimers, and limitations in the end user license agreement accompanying 
* the software package with which this file was provided.
*******************************************************************************/

#if !defined(CY_STATUS_REG_SWITCHES_H) /* CY_STATUS_REG_SWITCHES_H */
#define CY_STATUS_REG_SWITCHES_H

#include "cyfitter.h"

#if ((CYDEV_CHIP_FAMILY_USED == CYDEV_CHIP_FAMILY_PSOC3) || \
     (CYDEV_CHIP_FAMILY_USED == CYDEV_CHIP_FAMILY_PSOC4) || \
     (CYDEV_CHIP_FAMILY_USED == CYDEV_CHIP_FAMILY_PSOC5))
    #include "cytypes.h"
    #include "CyLib.h"
#else
    #include "syslib/cy_syslib.h"
#endif

    
/***************************************
*     Data Struct Definitions
***************************************/

/* Sleep Mode API Support */
typedef struct
{
    uint8 statusState;

} SWITCHES_BACKUP_STRUCT;


/***************************************
*        Function Prototypes
***************************************/

uint8 SWITCHES_Read(void) ;
void SWITCHES_InterruptEnable(void) ;
void SWITCHES_InterruptDisable(void) ;
void SWITCHES_WriteMask(uint8 mask) ;
uint8 SWITCHES_ReadMask(void) ;


/***************************************
*           API Constants
***************************************/

#define SWITCHES_STATUS_INTR_ENBL    0x10u


/***************************************
*         Parameter Constants
***************************************/

/* Status Register Inputs */
#define SWITCHES_INPUTS              2


/***************************************
*             Registers
***************************************/

/* Status Register */
#define SWITCHES_Status             (* (reg8 *) SWITCHES_sts_sts_reg__STATUS_REG )
#define SWITCHES_Status_PTR         (  (reg8 *) SWITCHES_sts_sts_reg__STATUS_REG )
#define SWITCHES_Status_Mask        (* (reg8 *) SWITCHES_sts_sts_reg__MASK_REG )
#define SWITCHES_Status_Aux_Ctrl    (* (reg8 *) SWITCHES_sts_sts_reg__STATUS_AUX_CTL_REG )

#endif /* End CY_STATUS_REG_SWITCHES_H */


/* [] END OF FILE */
